local/r6629_ro_20231203_03:24:19_sbtest_tableSize_5000_tableCount_1_time_30_x6_threadCount_1_core_1_sbtest_run.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 609.54 qps: 6096.38 (r/w/o: 6096.38/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 615.20 qps: 6152.99 (r/w/o: 6152.99/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 598.98 qps: 5989.81 (r/w/o: 5989.81/0.00/0.00) lat (ms,95%): 1.86 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 612.98 qps: 6129.75 (r/w/o: 6129.75/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 599.02 qps: 5991.23 (r/w/o: 5991.23/0.00/0.00) lat (ms,95%): 1.86 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 609.02 qps: 6092.17 (r/w/o: 6092.17/0.00/0.00) lat (ms,95%): 1.86 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 619.99 qps: 6195.88 (r/w/o: 6195.88/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 515.93 qps: 5163.29 (r/w/o: 5163.29/0.00/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 609.07 qps: 6089.74 (r/w/o: 6089.74/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 609.94 qps: 6096.42 (r/w/o: 6096.42/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 1 tps: 611.07 qps: 6117.66 (r/w/o: 6117.66/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 1 tps: 629.99 qps: 6293.86 (r/w/o: 6293.86/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 1 tps: 631.03 qps: 6310.30 (r/w/o: 6310.30/0.00/0.00) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 1 tps: 619.96 qps: 6201.61 (r/w/o: 6201.61/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 614.03 qps: 6140.32 (r/w/o: 6140.32/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 1 tps: 617.93 qps: 6175.31 (r/w/o: 6175.31/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 1 tps: 602.01 qps: 6020.06 (r/w/o: 6020.06/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 1 tps: 611.05 qps: 6111.52 (r/w/o: 6111.52/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 1 tps: 608.00 qps: 6086.05 (r/w/o: 6086.05/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 601.92 qps: 6021.23 (r/w/o: 6021.23/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 1 tps: 625.07 qps: 6242.69 (r/w/o: 6242.69/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 1 tps: 633.02 qps: 6335.22 (r/w/o: 6335.22/0.00/0.00) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 1 tps: 638.96 qps: 6385.62 (r/w/o: 6385.62/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 1 tps: 631.03 qps: 6314.31 (r/w/o: 6314.31/0.00/0.00) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 609.89 qps: 6094.95 (r/w/o: 6094.95/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 1 tps: 613.07 qps: 6136.66 (r/w/o: 6136.66/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 1 tps: 623.05 qps: 6229.48 (r/w/o: 6229.48/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 1 tps: 615.00 qps: 6150.96 (r/w/o: 6150.96/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 1 tps: 620.00 qps: 6195.02 (r/w/o: 6195.02/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 611.94 qps: 6119.37 (r/w/o: 6119.37/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            183700
        write:                           0
        other:                           0
        total:                           183700
    transactions:                        18370  (612.21 per sec.)
    queries:                             183700 (6122.11 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0042s
    total number of events:              18370

Latency (ms):
         min:                                    1.40
         avg:                                    1.63
         max:                                    9.81
         95th percentile:                        1.73
         sum:                                29946.31

Threads fairness:
    events (avg/stddev):           18370.0000/0.00
    execution time (avg/stddev):   29.9463/0.00