local/r6692_wo_20231202_04:04:51_sbtest_tableSize_5000_tableCount_17_time_30_x17_threadCount_17_core_1_sbtest_run.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 17
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 17 tps: 629.36 qps: 3844.96 (r/w/o: 0.00/2570.29/1274.67) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 17 tps: 642.24 qps: 3851.47 (r/w/o: 0.00/2567.98/1283.49) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 17 tps: 609.01 qps: 3645.04 (r/w/o: 0.00/2425.03/1220.01) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 17 tps: 645.94 qps: 3889.66 (r/w/o: 0.00/2597.78/1291.89) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 17 tps: 637.96 qps: 3817.78 (r/w/o: 0.00/2542.86/1274.93) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 17 tps: 648.93 qps: 3905.60 (r/w/o: 0.00/2606.74/1298.87) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 17 tps: 658.14 qps: 3933.84 (r/w/o: 0.00/2618.56/1315.28) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 17 tps: 662.98 qps: 4000.89 (r/w/o: 0.00/2673.93/1326.96) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 17 tps: 644.00 qps: 3856.99 (r/w/o: 0.00/2568.99/1288.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 17 tps: 651.96 qps: 3894.77 (r/w/o: 0.00/2591.84/1302.92) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 17 tps: 665.07 qps: 4002.43 (r/w/o: 0.00/2671.29/1331.14) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 17 tps: 651.01 qps: 3897.04 (r/w/o: 0.00/2595.02/1302.01) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 17 tps: 631.05 qps: 3803.28 (r/w/o: 0.00/2541.19/1262.09) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 17 tps: 609.91 qps: 3656.46 (r/w/o: 0.00/2438.64/1217.82) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 17 tps: 642.02 qps: 3838.09 (r/w/o: 0.00/2552.06/1286.03) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 17 tps: 612.99 qps: 3698.94 (r/w/o: 0.00/2472.96/1225.98) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 17 tps: 648.06 qps: 3888.36 (r/w/o: 0.00/2592.24/1296.12) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 17 tps: 643.97 qps: 3854.85 (r/w/o: 0.00/2566.90/1287.95) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 17 tps: 634.97 qps: 3813.84 (r/w/o: 0.00/2543.89/1269.95) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 17 tps: 650.99 qps: 3900.91 (r/w/o: 0.00/2598.94/1301.97) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 17 tps: 657.01 qps: 3937.08 (r/w/o: 0.00/2624.05/1313.03) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 17 tps: 649.02 qps: 3893.14 (r/w/o: 0.00/2594.09/1299.05) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 17 tps: 625.98 qps: 3771.88 (r/w/o: 0.00/2519.92/1251.96) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 17 tps: 625.98 qps: 3754.88 (r/w/o: 0.00/2502.92/1251.96) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 17 tps: 641.07 qps: 3846.43 (r/w/o: 0.00/2564.29/1282.14) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 17 tps: 610.97 qps: 3667.80 (r/w/o: 0.00/2445.87/1221.93) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 17 tps: 665.03 qps: 3944.18 (r/w/o: 0.00/2618.12/1326.06) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 17 tps: 615.99 qps: 3741.92 (r/w/o: 0.00/2505.95/1235.98) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 17 tps: 664.01 qps: 3966.05 (r/w/o: 0.00/2640.03/1326.02) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 17 tps: 650.95 qps: 3917.68 (r/w/o: 0.00/2613.78/1303.89) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           76980
        other:                           38490
        total:                           115470
    transactions:                        19245  (639.80 per sec.)
    queries:                             115470 (3838.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0779s
    total number of events:              19245

Latency (ms):
         min:                                    6.42
         avg:                                   26.50
         max:                                   77.12
         95th percentile:                       36.24
         sum:                               510025.79

Threads fairness:
    events (avg/stddev):           1132.0588/2.98
    execution time (avg/stddev):   30.0015/0.01